# CannotPlaceBalusterOffset Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..CannotPlaceBalusterOffset Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Can't place Balusters and/or Rails with desired offset
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotPlaceBalusterOffset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotPlaceBalusterOffset As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotPlaceBalusterOffset {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace